In [1]:
import pandas as pd

In [2]:
df_data = pd.read_csv('supermarket_sales.csv')

In [3]:
df_data.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3

In [4]:
#Qual o faturamento total da filial?
df_data.groupby('City')[['Total', 'gross income']].sum()

                 Total  gross income
City
Mandalay   106197.6720     5057.0320
Naypyitaw  110568.7065     5265.1765
Yangon     106200.3705     5057.1605

In [5]:
#Qual a percentual de participação na receita de cada tipo de produto?
(df_data.groupby('Product line')['Total'].sum() / df_data.groupby('Product line')['Total'].sum().sum()).sort_values() * 100

Product line
Health and beauty         15.231828
Home and lifestyle        16.677232
Fashion accessories       16.814702
Electronic accessories    16.824497
Sports and travel         17.067648
Food and beverages        17.384094
Name: Total, dtype: float64

In [6]:
#Como está distribuído o tipo de produto consumido por gênero
df_data.groupby(['Product line', 'Gender'])[['Total']].sum().pivot_table(index='Product line', columns='Gender')

                             Total
Gender                      Female        Male
Product line
Electronic accessories  27102.0225  27235.5090
Fashion accessories     30437.4000  23868.4950
Food and beverages      33170.9175  22973.9265
Health and beauty       18560.9865  30632.7525
Home and lifestyle      30036.8775  23825.0355
Sports and travel       28574.7210  26548.1055

In [7]:
#Qual foi o faturamento por mês?
df_data['Date'] = pd.to_datetime(df_data['Date'])
df_data['Month'] = df_data['Date'].apply(lambda x: x.month)
df_data['Year'] = df_data['Date'].apply(lambda x: x.year)
df_data.groupby(['Month'])['Total'].sum()

Month
1    116291.868
2     97219.374
3    109455.507
Name: Total, dtype: float64

In [8]:
#Qual foi a média de avaliação por cada filial em janeiro de 2019
df_data[(df_data['Year'] == 2019) & (df_data['Month'] == 1)]['Rating'].mean()

np.float64(7.017613636363635)

In [9]:
#Como se distribui o gasto por tipo de consumidor em cada filial
df_data.groupby(['Customer type', 'City'])['Total'].sum()

Customer type  City
Member         Mandalay     53704.6860
               Naypyitaw    56881.2825
               Yangon       53637.4755
Normal         Mandalay     52492.9860
               Naypyitaw    53687.4240
               Yangon       52562.8950
Name: Total, dtype: float64

In [10]:
import numpy as np

In [11]:
labels = ['a', 'b', 'c']
minha_lista = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a':10, 'b':20, 'c':30}

In [12]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [13]:
pd.Series(data=labels, index=minha_lista) #Poderia ter feito pd.Series(labels, minha_lista) que daria o mesmo resultado

10    a
20    b
30    c
dtype: object

In [14]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [15]:
ser1 = pd.Series([1,2,3,4],index=['EUA', 'Alemanha', 'Russia', 'Japão'])

In [16]:
ser1

EUA         1
Alemanha    2
Russia      3
Japão       4
dtype: int64

In [17]:
ser2 = pd.Series([1,2,5,4],index=['EUA', 'Alemanha', 'Italia', 'Japão'])
ser2

EUA         1
Alemanha    2
Italia      5
Japão       4
dtype: int64

In [18]:
ser1['EUA']

np.int64(1)

In [19]:
ser1[['Alemanha','Russia']]

Alemanha    2
Russia      3
dtype: int64

In [20]:
ser1 + ser2

Alemanha    4.0
EUA         2.0
Italia      NaN
Japão       8.0
Russia      NaN
dtype: float64

###DataFrames

In [21]:
from numpy.random import randn

In [22]:
df = pd.DataFrame(randn(5,4), index=['A',"B",'C','D','E'], columns='W X Y Z'.split())
df

          W         X         Y         Z
A  1.190673  0.128545  1.683376  1.043104
B -0.662346 -0.768325  2.370305 -0.418629
C  0.286034 -0.220532  1.035196 -1.035812
D  1.627426 -0.385970 -0.516514  0.950225
E -0.589156 -1.855793  1.329620  0.168649

In [23]:
df['W']

A    1.190673
B   -0.662346
C    0.286034
D    1.627426
E   -0.589156
Name: W, dtype: float64

In [24]:
df[['W']]

          W
A  1.190673
B -0.662346
C  0.286034
D  1.627426
E -0.589156

In [25]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  1.190673  0.128545  1.683376  1.043104  2.874050
B -0.662346 -0.768325  2.370305 -0.418629  1.707959
C  0.286034 -0.220532  1.035196 -1.035812  1.321229
D  1.627426 -0.385970 -0.516514  0.950225  1.110913
E -0.589156 -1.855793  1.329620  0.168649  0.740465

In [26]:
df.drop('new', axis=1) #ais = 1 corresponde a colunas e axis =0 linhas

          W         X         Y         Z
A  1.190673  0.128545  1.683376  1.043104
B -0.662346 -0.768325  2.370305 -0.418629
C  0.286034 -0.220532  1.035196 -1.035812
D  1.627426 -0.385970 -0.516514  0.950225
E -0.589156 -1.855793  1.329620  0.168649

In [27]:
df

          W         X         Y         Z       new
A  1.190673  0.128545  1.683376  1.043104  2.874050
B -0.662346 -0.768325  2.370305 -0.418629  1.707959
C  0.286034 -0.220532  1.035196 -1.035812  1.321229
D  1.627426 -0.385970 -0.516514  0.950225  1.110913
E -0.589156 -1.855793  1.329620  0.168649  0.740465

In [28]:
df.drop('new', axis=1, inplace=True) #retira a coluna new do arquivo original

In [29]:
df

          W         X         Y         Z
A  1.190673  0.128545  1.683376  1.043104
B -0.662346 -0.768325  2.370305 -0.418629
C  0.286034 -0.220532  1.035196 -1.035812
D  1.627426 -0.385970 -0.516514  0.950225
E -0.589156 -1.855793  1.329620  0.168649

In [30]:
df.loc['A']

W    1.190673
X    0.128545
Y    1.683376
Z    1.043104
Name: A, dtype: float64

In [31]:
df.loc[['A', 'B']]

          W         X         Y         Z
A  1.190673  0.128545  1.683376  1.043104
B -0.662346 -0.768325  2.370305 -0.418629

In [32]:
df.iloc[0,2] #primeiro valor será a linha e o segundo a coluna para acessar uma célula da tabela

np.float64(1.6833763258527885)

In [33]:
df.iloc[:-1, :]

          W         X         Y         Z
A  1.190673  0.128545  1.683376  1.043104
B -0.662346 -0.768325  2.370305 -0.418629
C  0.286034 -0.220532  1.035196 -1.035812
D  1.627426 -0.385970 -0.516514  0.950225

In [34]:
df.iloc[1:4, 1:3]

          X         Y
B -0.768325  2.370305
C -0.220532  1.035196
D -0.385970 -0.516514

In [35]:
df + df

          W         X         Y         Z
A  2.381347  0.257091  3.366753  2.086209
B -1.324692 -1.536650  4.740609 -0.837258
C  0.572067 -0.441065  2.070391 -2.071625
D  3.254853 -0.771940 -1.033027  1.900449
E -1.178311 -3.711586  2.659240  0.337298

In [36]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B  False  False   True  False
C   True  False   True  False
D   True  False  False   True
E  False  False   True   True

In [37]:
df[df > 0]

          W         X         Y         Z
A  1.190673  0.128545  1.683376  1.043104
B       NaN       NaN  2.370305       NaN
C  0.286034       NaN  1.035196       NaN
D  1.627426       NaN       NaN  0.950225
E       NaN       NaN  1.329620  0.168649

In [38]:
df['Y'] > 0

A     True
B     True
C     True
D    False
E     True
Name: Y, dtype: bool

In [39]:
df[df['X'] > 0]

          W         X         Y         Z
A  1.190673  0.128545  1.683376  1.043104

In [40]:
df[(df['X'] > 0) & (df['W'] > 0)]

          W         X         Y         Z
A  1.190673  0.128545  1.683376  1.043104

In [41]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [42]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [43]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.190673  0.128545  1.683376  1.043104
1     B -0.662346 -0.768325  2.370305 -0.418629
2     C  0.286034 -0.220532  1.035196 -1.035812
3     D  1.627426 -0.385970 -0.516514  0.950225
4     E -0.589156 -1.855793  1.329620  0.168649

In [44]:
df

          W         X         Y         Z
A  1.190673  0.128545  1.683376  1.043104
B -0.662346 -0.768325  2.370305 -0.418629
C  0.286034 -0.220532  1.035196 -1.035812
D  1.627426 -0.385970 -0.516514  0.950225
E -0.589156 -1.855793  1.329620  0.168649

In [45]:
df.reset_index(inplace=True)
df

  index         W         X         Y         Z
0     A  1.190673  0.128545  1.683376  1.043104
1     B -0.662346 -0.768325  2.370305 -0.418629
2     C  0.286034 -0.220532  1.035196 -1.035812
3     D  1.627426 -0.385970 -0.516514  0.950225
4     E -0.589156 -1.855793  1.329620  0.168649

In [46]:
df.set_index("index", inplace=True)
df

              W         X         Y         Z
index
A      1.190673  0.128545  1.683376  1.043104
B     -0.662346 -0.768325  2.370305 -0.418629
C      0.286034 -0.220532  1.035196 -1.035812
D      1.627426 -0.385970 -0.516514  0.950225
E     -0.589156 -1.855793  1.329620  0.168649

In [47]:
novoind = 'CA NY WY OR CO'.split()
novoind

['CA', 'NY', 'WY', 'OR', 'CO']

In [48]:
df['novo_index'] = novoind
df

              W         X         Y         Z novo_index
index
A      1.190673  0.128545  1.683376  1.043104         CA
B     -0.662346 -0.768325  2.370305 -0.418629         NY
C      0.286034 -0.220532  1.035196 -1.035812         WY
D      1.627426 -0.385970 -0.516514  0.950225         OR
E     -0.589156 -1.855793  1.329620  0.168649         CO

In [49]:
df.set_index('novo_index')
df

              W         X         Y         Z novo_index
index
A      1.190673  0.128545  1.683376  1.043104         CA
B     -0.662346 -0.768325  2.370305 -0.418629         NY
C      0.286034 -0.220532  1.035196 -1.035812         WY
D      1.627426 -0.385970 -0.516514  0.950225         OR
E     -0.589156 -1.855793  1.329620  0.168649         CO

###Índices multiníveis

In [50]:
#Níveis de Índices 
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))

In [51]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [52]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [53]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A','B']) #6 linhas e 2 colunas
df

             A         B
G1 1  2.012066 -1.760352
   2  0.093958 -0.343361
   3  0.917735 -0.580258
G2 1 -0.121793 -0.713107
   2 -1.564087 -1.996588
   3  1.101624 -1.356163

In [54]:
df.loc['G1']

          A         B
1  2.012066 -1.760352
2  0.093958 -0.343361
3  0.917735 -0.580258

In [55]:
df.loc['G1'].loc[1]

A    2.012066
B   -1.760352
Name: 1, dtype: float64

In [56]:
df.index.names = ['Grupo', 'Número']
df

                     A         B
Grupo Número
G1    1       2.012066 -1.760352
      2       0.093958 -0.343361
      3       0.917735 -0.580258
G2    1      -0.121793 -0.713107
      2      -1.564087 -1.996588
      3       1.101624 -1.356163

In [57]:
df.xs('G1')

               A         B
Número
1       2.012066 -1.760352
2       0.093958 -0.343361
3       0.917735 -0.580258

In [58]:
df.xs(1, level='Número')

              A         B
Grupo
G1     2.012066 -1.760352
G2    -0.121793 -0.713107

###Tratamento de dados ausêntes

In [59]:
df_1 = pd.DataFrame({
    'A': [1,2,np.nan],
    'B': [5,np.nan, np.nan],
    'C': [1,2,3]
})
df_1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [60]:
df_1.dropna(axis=0) #Corte dos dados nan nas linhas -> axis = 0

     A    B  C
0  1.0  5.0  1

In [61]:
df_1.dropna(axis=1) #Corte dos dados nan nas colunas -> axis =1

   C
0  1
1  2
2  3

In [62]:
df_1.dropna(axis = 1, thresh=2) #O corte irá acontecer nas colunas que tiverem dois ou mais nan -> thresh = 2 -> limite >= 2

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [63]:
df_1.fillna(0) # preenche os dados nan com 0 -> fillna(0) -> poderia ser qualquer coisa no lugar do 0, até uma string 'conteúdo'

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [64]:
df_1['A'].sum() #Vai somar os valores da coluna A
df_1['A']. mean() #Média dos valores da coluna A

np.float64(1.5)

In [65]:
df_1['A'].fillna(value=df_1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [66]:
df_1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [67]:
df_1.ffill() #Preenche os nan com o último valor acima
#df_1.bfill() vai preencher com os valores de baixo

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

###Groupby

In [68]:
data = {
    'Classe': ['Júnior', 'Júnior', 'Pleno', 'Pleno', 'Sênior', 'Sênior'],
    'Nome': ['Jorge', 'Carlos', 'Roberta', 'Patrícia', 'Bruno', 'Vera'],
    'Venda': [200,120,340,124,243,350]
}

In [69]:
df_2 = pd.DataFrame(data)
df_2

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [70]:
group = df_2.groupby('Classe')

In [71]:
group.sum()

                   Nome  Venda
Classe
Júnior      JorgeCarlos    320
Pleno   RobertaPatrícia    464
Sênior        BrunoVera    593

In [72]:
group_2 = df_2.groupby("Classe").min() #Quem vendeu menos
group_2

            Nome  Venda
Classe
Júnior    Carlos    120
Pleno   Patrícia    124
Sênior     Bruno    243

In [73]:
group_2 = df_2.groupby('Classe').max()
group_2

           Nome  Venda
Classe
Júnior    Jorge    200
Pleno   Roberta    340
Sênior     Vera    350

In [74]:
df_2

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [75]:
df_3 = df_2.copy()

In [76]:
df_3['Venda'] = [150,432,190,230,410,155]

In [77]:
df_3

   Classe      Nome  Venda
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      Vera    155

In [78]:
df_2

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [79]:
df_4 = pd.concat([df_2,df_3])
df_4

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      Vera    155

In [80]:
group_3 = df_4.groupby(['Classe', 'Nome']).sum()
group_3

                 Venda
Classe Nome
Júnior Carlos      552
       Jorge       350
Pleno  Patrícia    354
       Roberta     530
Sênior Bruno       653
       Vera        505

###Merge, concat e join

In [81]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])

In [82]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                            'B': ['B4', 'B5', 'B6', 'B7'],
                            'C': ['C4', 'C5', 'C6', 'C7'],
                            'D': ['D4', 'D5', 'D6', 'D7']},
                            index=[4, 5, 6, 7])

In [83]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                    index=[8, 9, 10, 11])

In [84]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [85]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [86]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [87]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [88]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [89]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                            'A': ['A0', 'A1', 'A2', 'A3'],
                            'B': ['B0', 'B1', 'B2', 'B3']})

In [90]:
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})

In [91]:
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [92]:
direita

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [93]:
pd.merge(esquerda, direita, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [94]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                        'key2': ['K0', 'K1', 'K0', 'K1'],
                            'A': ['A0', 'A1', 'A2', 'A3'],
                            'B': ['B0', 'B1', 'B2', 'B3']})

In [95]:
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                                'key2': ['K0', 'K0', 'K0', 'K0'],
                                    'C': ['C0', 'C1', 'C2', 'C3'],
                                    'D': ['D0', 'D1', 'D2', 'D3']})

In [96]:
pd.merge(esquerda, direita, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [97]:
pd.merge(esquerda, direita, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

In [98]:
pd.merge(esquerda, direita, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [99]:
pd.merge(esquerda, direita, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [100]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                        'B': ['B0', 'B1', 'B2']},
                        index=['K0', 'K1', 'K2'])

In [101]:
direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                        'D': ['D0', 'D2', 'D3']},
                        index=['K0', 'K2', 'K3'])

In [102]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [103]:
esquerda.join(direita, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

###Operações com DataFrame

In [105]:
df = pd.DataFrame({'col1': [1,2,3,4], 'col2': [444,555,666,444], 'col3': ['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [106]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [107]:
df.memory_usage()

Index    132
col1      32
col2      32
col3      32
dtype: int64

In [ ]:
#Informações sobre valores exclusivos
df['col2'].unique #Quais os valores únicos nesta coluna

<bound method Series.unique of 0    444
1    555
2    666
3    444
Name: col2, dtype: int64>

In [ ]:
df['col2'].nunique() #Quantos valores únicos existem nesta coluna

3

In [ ]:
df['col2'].value_counts() #Quais e quantos valores únicos

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [111]:
#Aplicando funções
def comp(x):
    return x ** 2 + 3

In [112]:
df['col1'].apply(comp)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [113]:
df['col1_calc'] = df['col1'].apply(comp)

In [114]:
df

   col1  col2 col3  col1_calc
0     1   444  abc          4
1     2   555  def          7
2     3   666  ghi         12
3     4   444  xyz         19

In [115]:
df['col1'].apply(lambda x: x**2 + 3)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [116]:
df['col1'].sum()

np.int64(10)

In [117]:
df['col1'].mean()

np.float64(2.5)

In [118]:
df['col1'].product()

np.int64(24)

In [119]:
df['col1'].std() #desvio padrão

1.2909944487358056

In [120]:
df['col1'].max()

4

In [121]:
df['col1'].min()

1

In [122]:
df['col1'].idxmax()

3

In [125]:
df[df['col2'] == 444]

   col1  col2 col3  col1_calc
0     1   444  abc          4
3     4   444  xyz         19

In [126]:
df[df['col2'] == 444]['col1'].sum()

np.int64(5)

In [127]:
df.sort_values(by='col2')

   col1  col2 col3  col1_calc
0     1   444  abc          4
3     4   444  xyz         19
1     2   555  def          7
2     3   666  ghi         12

In [128]:
data = {'A':['foo', 'foo', 'foo', 'bar','bar', 'bar'], 
        'B':['one', 'one', 'two', 'two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [129]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [130]:
dict_map = {'one': '1', 'two': '2'}

In [131]:
df['E'] = df['B'].map(dict_map)

In [132]:
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [133]:
df.pivot_table(index='A', columns='B', values='D')

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0

#Séries Temporais